src/DataProcessors/ЗагрузкаДанныхИзФайлаЭксель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхИзФайлаЭксель</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПродажиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ЗагрузкаДанныхИзФайлаЭксель/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.СогласовыватьЦены.Видимость = ПользовательСПолнымиПравами();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбработатьВыборФайла();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьВыборФайла()
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Таблицы|*xls;*xlsx;*mxl;*ods";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	
	Результат = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	Если Не ПроверитьЗаполнение()Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьФайл();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьФайл()
	
	Перем ОписаниеФайла;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПутьКФайлу,УникальныйИдентификатор);
	
	Если ОписаниеФайла = Неопределено ИЛИ ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗагрузки = ЗагрузитьФайлНаСервере(ОписаниеФайла.Адрес, УникальныйИдентификатор);
	
	СоздаватьНоменклатуру = Ложь;
	
	Если Не РезультатЗагрузки.ВсяНоменклатураНайдена Тогда
		
		ТекстВопроса = "Не все позиции из файла существуют в справочнике. Выберите вариант действий:";
		
		ВариантыОтвета = НовыйВариантыОтвета();
		
		ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, ВариантыОтвета);
		
		Если ОтветПользователя = "Нет" Тогда
			Возврат;
		ИначеЕсли ОтветПользователя = "Да" Тогда
			СоздаватьНоменклатуру = Истина;
		КонецЕсли;

	КонецЕсли;

	СоздатьДокумент(Контрагент,РезультатЗагрузки.АдресДанныхФайла,СогласовыватьЦены,СоздаватьНоменклатуру);
	
КонецПроцедуры

&НаКлиенте
Функция НовыйВариантыОтвета()
	
	ВариантыОтвета = Новый СписокЗначений;
	ВариантыОтвета.Вставить(0, "Нет", "Не создавать документ");
	ВариантыОтвета.Вставить(1, "НетЦены", "Не загружать цены");
	ВариантыОтвета.Вставить(2, "Да", "Создавать номенклатуру");
	
	Возврат ВариантыОтвета;
	
КонецФункции


&НаСервере
Функция ЗагрузитьФайлНаСервере(АдресФайлаВоВременномХранилище, УникальныйИдентификатор)
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	
	РезультатЗагрузки = Новый Структура("ВсяНоменклатураНайдена, АдресДанныхФайла", Истина, Неопределено);
	
	ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременногоФайла);
	УдалитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	ДанныеФайла = Новый Массив;
	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");
	
	Для Сч = 2 По КоличествоСтрок Цикл
		
		НаименованиеНоменклатуры = ТабличныйДокумент.Область(Сч,1).Текст;
		Цена = ТабличныйДокумент.Область(Сч,2).Текст;
		
		ДанныеСтрокиДокумента = Новый Структура;
		ДанныеСтрокиДокумента.Вставить("НаименованиеНоменклатуры", НаименованиеНоменклатуры);
		ДанныеСтрокиДокумента.Вставить("Цена", Цена);
		
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатуры); 
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, НаименованиеНоменклатуры);
			Сообщение.Сообщить();

			РезультатЗагрузки.ВсяНоменклатураНайдена = Ложь;
			
		КонецЕсли;
		
		ДанныеСтрокиДокумента.Вставить("НоменклатураСсылка", Номенклатура);
		ДанныеФайла.Добавить(ДанныеСтрокиДокумента);
		
	КонецЦикла;
	
	РезультатЗагрузки.АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификатор);
	
КонецПроцедуры

Процедура СоздатьДокумент(Контрагент, АдресДанныхФайла, СогласовыватьЦены, СоздаватьНоменклатуру)

	// Создаём новый документ
	ДокументЦены = Документы.УстановкаЦен.СоздатьДокумент();
	ДокументЦены.Дата = ТекущаяДата();
	ДокументЦены.Контрагент = Контрагент;
	ДокументЦены.Комментарий = "Загружен из файла";

	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресДанныхФайла);

	Для Каждого ДанныеСтроки Из ДанныеФайла Цикл

		Номенклатура = ДанныеСтроки.НоменклатураСсылка;

		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Если Не СоздаватьНоменклатуру Тогда
				Продолжить;
			Иначе
				Номенклатура = СоздатьНоменклатуру(ДанныеСтроки);
				Если Номенклатура = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		НоваяСтрокаТЧ = ДокументЦены.Цены.Добавить();
		НоваяСтрокаТЧ.Номенклатура = Номенклатура;
		НоваяСтрокаТЧ.Цена = ДанныеСтроки.Цена;

	КонецЦикла;

	Если СогласовыватьЦены Тогда
		ДокументЦены.Согласовано = Истина;
		ДокументЦены.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокументЦены.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;

	УдалитьИзВременногоХранилища(АдресДанныхФайла);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьНоменклатуру(ДанныеСтроки)
	
	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	Номенклатура.Наименование = ДанныеСтроки.НаименованиеНоменклатуры;
	Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	
	Попытка
		Номенклатура.Записать();
		Сообщить(СтрШаблон(НСтр("ru = 'Номенклатура %1 создана'"),ДанныеСтроки.НаименованиеНоменклатуры));
		
		Возврат Номенклатура.Ссылка;
		
	Исключение
		Сообщить(СтрШаблон(НСтр("ru = 'Номенклатура %1 не создана по причине: %2'"),ДанныеСтроки.НаименованиеНоменклатуры,ОписаниеОшибки()));
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПользовательСПолнымиПравами()
	
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава);
	
КонецФункции

&НаКлиенте
Процедура СообщитьПользователю(Текст)
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = Текст;
	СообщениеПользователю.Сообщить();

КонецПроцедуры
